# KipsPerSquareFoot Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..KipsPerSquareFoot Property
UnitTypeId Class See Also
---
Kips per square foot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KipsPerSquareFoot { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KipsPerSquareFoot As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KipsPerSquareFoot {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace